## Reading and Writing Data in Text Format

In [1]:
import pandas as pd
import numpy as np

pandas features a number of functions for reading tabular data as a DataFrame object. 

Text and binary data loading functions in pandas
read_csv: Load delimited data from a file, URL, or file-like object; use comma as default delimiter
read_fwf: Read data in fixed-width column format (i.e., no delimiter)
read_clipboard: Variation of read_csv that reads data from the clipboard; useful for converting tables from web pages
read_excel: Read tabular data from an Excel XLS or XLSX file
read_hdf: Read HDF5 files written by pandas
read_html: Read all tables found in the given HTML document
read_jason: Read data from a JSON (JavaScript Object Notation) string representation, file, URL, or file-like object
read_feather: Read the Feather binary file format
read_orc: Read the Apache ORC binary file format
read_parquet: Read the Apache Parquet binary file format
read_pickle: Read an object stored by pandas using the Python pickle format
read_sas: Read a SAS dataset stored in one of the SAS systemâ€™s custom storage formats
read_spss: Read a data file created by SPSS
read_sql: Read the results of a SQL query (using SQLAlchemy)
read_sql_table: Read a whole SQL table (using SQLAlchemy); equivalent to using a query that selects everything in
 that table using read_sql
read_stata: Read a dataset from Stata file format
read_xml: Read a table of data from an XML file

optional arguments for the above functions
1. Indexing
   Can treat one or more columns as the returned DataFrame, and whether to get column names from the file, arguments you          provide, or not at all.
2. Type inference and data conversion
   Includes the user-defined value conversions and custom list of missing value markers.
3. Date and time parsing
   Includes a combining capability, including combining date and time information spread over multiple columns into a single      column in the result.
4. Iterating 
   Support for iterating over chunks of very large files.
5. Unclean data issues
    Includes skipping rows or a footer, comments, or other minor things like numeric data with thousands separated by commas.

In [2]:
df = pd.read_csv("examples/ex1.csv")

In [3]:
# This file has a header row
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
# but a file will not always have a header row. let's see this
pd.read_csv("examples/ex2.csv")

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [5]:
# To read this file, we have a couple of options. we can allow pandas to assign default
# column names, or specify names ourself:
# first let's tell pandas the file has not its own header so give default header row
pd.read_csv("examples/ex2.csv", header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
# let's specify the column names
pd.read_csv("examples/ex2.csv", names = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Message'])

   Monday  Tuesday  Wednesday  Thursday Message
0       1        2          3         4   hello
1       5        6          7         8   world
2       9       10         11        12     foo

In [7]:
# If we want to the "message" column to be the row index of the returned dataframe
pd.read_csv("examples/ex2.csv", names = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Message'], index_col= "Message")

         Monday  Tuesday  Wednesday  Thursday
Message
hello         1        2          3         4
world         5        6          7         8
foo           9       10         11        12

In [8]:
pd.read_csv("examples/csv_mindex.csv")

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [9]:
# If we want to form a hierarchical index from multiple columns, we can pass a list of column numbers or names
parsed = df = pd.read_csv("examples/csv_mindex.csv", index_col = ['key1', 'key2'])

In [10]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [11]:
# the default separarator for values in csv file is comma
# but what if the values are separated by other separators
# for example this the space separeted text file we can pass a regular expression argument to read_csv '\s+'
pd.read_csv("examples/ex3.txt", sep = r"\s+")

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [12]:
# we can skip rows from a file
# in the file below we skipped row 0, 2, 3
pd.read_csv("examples/ex4.csv", skiprows = [0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
# let's open a csv fill with missing data(either empty string or marked by some palce holders like NA and NULL)
df = pd.read_csv("examples/ex5.csv")

In [14]:
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [15]:
# let's use isna() function to check if there is a missing value
pd.isna(df)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [16]:
# The na_values option accepts a sequence of strings to add to the default list of strings
# recognized as missing:
# in this case we add "NULL" to default missing list of strings recognized as missing by pandas
df = pd.read_csv("examples/ex5.csv", na_values = ['NULL'])

In [17]:
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [18]:
# pandas.read_csv has a list of many default NA value representations, but these
# defaults can be disabled with the keep_default_na option:
df = pd.read_csv('examples/ex5.csv', keep_default_na = False)
df

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [19]:
# let's check for the missing value
# since we scrap the pandas default NA values the isna() function returns there is no missing value
pd.isna(df)

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [20]:
# if we want to catch a specific missing values we can pass na_values with that specific placeholder name
# for example let's catch 'NA' place holder
pd.read_csv('examples/ex5.csv', keep_default_na = False, 
                na_values = ["NA"])

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [21]:
# now lets catch empty string
pd.read_csv('examples/ex5.csv', keep_default_na = False, 
                na_values = [""])

  something  a   b     c   d message
0       one  1   2   3.0   4      NA
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
pd.read_csv('examples/ex5.csv', keep_default_na = False)

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [23]:
# we can specify different NA sentinels for different column
# for example let's make 'foo' and 'NA' as NA sentinels from the message column
# 'two' from 'something column'
sentinels = {"message": ["foo", "NA"], "something": ["two"]}
df1 = pd.read_csv('examples/ex5.csv', keep_default_na = False, na_values = sentinels)
df1

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [24]:
# check for missing values
pd.isna(df1)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1       True  False  False  False  False    False
2      False  False  False  False  False     True

Some pandas.read_csv function arguments
sep or delimiter: Character sequence or regular expression to use to split fields in each row.
header: Row number to use as column names; defaults to 0 (first row), but should be None if there is no header row.
index_col: Column numbers or names to use as the row index in the result; can be a single name/number or a
           list of them for a hierarchical index.
names: List of column names for result.
skiprows: Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.
na_values: Sequence of values to replace with NA. They are added to the default list unless keep_default_na=False is passed.
keep_default_na: Whether to use the default NA value list or not (True by default).
nrows: Number of rows to read from beginning of file (not counting the header)
skip_footer: Number of lines to ignore at end of file.
verbose: Print various parsing information, like the time spent in each stage of the file conversion and memory use                     information.
encoding: Text encoding (e.g., "utf-8 for UTF-8 encoded text). Defaults to "utf-8" if None.
squeeze: If the parsed data contains only one column, return a Series.
thousands: Separator for thousands (e.g., "," or "."); default is None.
decimal: Decimal separator in numbers (e.g., "." or ","); default is ".".

###  Reading Text Files in Pieces

When processing very large files or figuring out the right set of arguments to correctly process a large file, we may want to read only a small piece of a file or iterate through smaller chunks of the file.

In [25]:
# Before we look at a large file, we make the pandas display settings more compact:
pd.options.display.max_rows = 10

In [26]:
f = pd.read_csv("examples/ex6.csv")
f

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [27]:
pd.reset_option('display.max_rows')

In [28]:
# if we want to read only a smaller number of rows, we can specify the number of rows
# we can read the first 6 rows by passing "nrows = 6" argument 
pd.read_csv("examples/ex6.csv", nrows = 12)

         one       two     three      four key
0   0.467976 -0.038649 -0.295344 -1.824726   L
1  -0.358893  1.404453  0.704965 -0.200638   B
2  -0.501840  0.659254 -0.421691 -0.057688   G
3   0.204886  1.074134  1.388361 -0.982404   R
4   0.354628 -0.133116  0.283763 -0.837063   Q
5   1.817480  0.742273  0.419395 -2.251035   Q
6  -0.776764  0.935518 -0.332872 -1.875641   U
7  -0.913135  1.530624 -0.572657  0.477252   K
8   0.358480 -0.497572 -0.367016  0.507702   S
9  -1.740877 -1.160417 -1.637830  2.172201   G
10  0.240564 -0.328249  1.252155  1.072796   8
11  0.764018  1.165476 -0.639544  1.495258   R

In [29]:
# To read a file in pieces, specify a chunksize as a number of rows:
file = pd.read_csv("examples/ex6.csv", chunksize = 1000)
type(file)

pandas.io.parsers.readers.TextFileReader

In [30]:
# Let's count the frequency of each "key" values
tot = pd.Series([], dtype = 'int64')
for piece in file:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0)

tot = tot.sort_values(ascending = False)
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

###  Writing Data to Text Format

In [31]:
# let's write a given data to "1.csv" file
data = pd.DataFrame({'Name': ['Alice', 'Bob'], 'Age': [25, 30]})
data.to_csv('1.csv', index = False) # "index = False" argument used to avoid default row index from writting to the file

In [32]:
# Data can also be exported to a delimited format. Letâ€™s consider one of the CSV files read before:
data = pd.read_csv("examples/ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [33]:
# we can write the above data to new file
data.to_csv("data.csv", index = False)

In [34]:
# we can print to the console by writting to "sys.stdout"
import sys
data.to_csv(sys.stdout, index = False)

something,a,b,c,d,message
one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [35]:
# of course we can pass other delimiter
data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [36]:
#  Missing values appear as empty strings in the output. we might want to denote them
# by some other sentinel value:
data.to_csv(sys.stdout, sep = '|', na_rep = "NULL")

|something|a|b|c|d|message
0|one|1|2|3.0|4|NULL
1|two|5|6|NULL|8|world
2|three|9|10|11.0|12|foo

In [37]:
# With no other options specified, both the row and column labels are written. Both of
# these can be disabled:
data.to_csv(sys.stdout, header = False, index = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [38]:
# we can also write only a subset of the columns, and in an order of our choosing:
data.to_csv(sys.stdout, index = False, columns = ['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

### Working with Other Delimited Format

In [39]:
pd.read_csv("examples/ex7.csv")

   a  b  c
0  1  2  3
1  1  2  3

In [40]:
# we can use csv module
import csv
with open("examples/ex7.csv") as f:
    file = csv.reader(f)
    for line in file:
        print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [41]:
#  From there, itâ€™s up to us to do the wrangling necessary to put the data in the form
# that we need. Letâ€™s take this step by step. First, we read the file into a list of lines:
with open("examples/ex7.csv") as f:
    file = csv.reader(f)
    lines = list(file)
    header, values = lines[0], lines[1:]
    # lets create a dictionary
    d = {h: v for h, v in zip(header, zip(*values))}
    print(d)

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### JSON Data

JSON (JavaScript Object Notation) is a lightweight data format used for storing and exchanging data. It is human-readable and widely used in APIs and web applications.

A JSON file typically contains key-value pairs, similar to Python dictionaries:

Typical example of JSON file
{
    "name": "Alice",
    "age": 25,
    "city": "New York",
    "skills": ["Python", "Machine Learning"]
}

### Handling JSON in Python (json module)

In [42]:
import json
f = '''{
    "name": "Alice",
    "age": 25,
    "city": "New York",
    "skills": ["Python", "Machine Learning"]
}
'''

data = json.loads(f)

In [43]:
data

{'name': 'Alice',
 'age': 25,
 'city': 'New York',
 'skills': ['Python', 'Machine Learning']}

In [44]:
data['name']

'Alice'

In [45]:
data['skills']

['Python', 'Machine Learning']

In [46]:
# convert python dictionaries to JSON
python_dict = {"name": "Bob", "age": 30, "city": "London"}

json_str = json.dumps(python_dict, indent = 4)

In [47]:
print(json_str)

{
    "name": "Bob",
    "age": 30,
    "city": "London"
}

In [48]:
obj = """
 {"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
 }
 """

In [49]:
result = json.loads(obj)

In [50]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [51]:
# access values
result['name']

'Wes'

In [52]:
result['cities_lived']

['Akron', 'Nashville', 'New York', 'San Francisco']

In [54]:
for sibling in result['siblings']:
    print(f"Name: {sibling['name']}, Age: {sibling['age']}")

Name: Scott, Age: 34
Name: Katie, Age: 42

In [ ]:
with open("datasets/CA_category_id.json", "r", encoding = "utf-8") as f:
    json_data = f.read()

In [ ]:
data = json.loads(json_data)

In [ ]:
data['kind']

In [ ]:
print('....Title....')
for items in data['items']:
    print(items['snippet']['title'])

### Writing JSON Files

In [ ]:
data = {
    "name": "Alice",
    "age": 25,
    "city": "New York"
}

with open('1.json', 'w') as f:
    json.dump(data, f, indent = 4)

### Read JSON in pandas

In [ ]:
data = pd.read_json("examples/example.json")

In [ ]:
data

to export data from pandas to JSON, one way is to use the to_json methods on Series and DataFrame:

In [ ]:
import sys
data.to_json(sys.stdout, indent = 4, orient = "records")

## XML and HTML: Web Scraping

Python has many libraries for reading and writing data in the ubiquitous HTML and
XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is
comparatively much faster in general, the other libraries can better handle malformed
HTML or XML files.

In [ ]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [ ]:
len(tables)

In [ ]:
failures = tables[0]

In [ ]:
failures.head()

In [ ]:
failures.nunique()